---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoParents
source: html/d85dbd98-8a0c-6750-c2d1-8fec451d8a08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoParents Property

Can't Copy to Clipboard because of relationships between Elements

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyNoParents { get; }
```